interfaces/src/main/resources/templates/ZoekPersoonOpAdres/02.02.0000/template.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header/>
    <soap:Body>
        <ns2:ZoekPersoonOpAdres xmlns:ns2="http://magda.vlaanderen.be/persoon/soap/zoekpersoonopadres/v02_02" xmlns:ns3="http://magda.vlaanderen.be/generiek/oslo-v3">
            <Verzoek>
                <Context>
                    <Naam>ZoekPersoonOpAdres</Naam>
                    <Versie>02.02.0000</Versie>
                    <Bericht>
                        <Type>VRAAG</Type>
                        <Tijdstip>
                            <Datum>2022-09-08</Datum>
                            <Tijd>08:49:02.658</Tijd>
                        </Tijdstip>
                        <Afzender>
                            <Identificatie>Afzender-A</Identificatie>
                            <Referte>7bcb1e73-755c-4e9c-a3ef-ba030949cc1b</Referte>
                            <Hoedanigheid>188</Hoedanigheid>
                        </Afzender>
                    </Bericht>
                </Context>
                <Vragen>
                    <Vraag>
                        <Referte>vraagreferte</Referte>
                        <Inhoud>
                            <Criteria>
                                <Adres>
                                    <PostCode>POSTCODE</PostCode>
                                    <Straatcode>1234</Straatcode>
                                    <Huisnummer>HUISNUMMER</Huisnummer>
                                </Adres>
                                <EnkelReferentiepersoon>0</EnkelReferentiepersoon>
                            </Criteria>
                            <Bron>RR</Bron>
                            <Taal>nl</Taal>
                        </Inhoud>
                    </Vraag>
                </Vragen>
            </Verzoek>
        </ns2:ZoekPersoonOpAdres>
    </soap:Body>
</soap:Envelope>